# RoomCalculatedHeatingLoadPerAreaParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomCalculatedHeatingLoadPerAreaParam Property
ParameterTypeId Class See Also
---
"Calculated Heating Load per area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomCalculatedHeatingLoadPerAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomCalculatedHeatingLoadPerAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomCalculatedHeatingLoadPerAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace